Tekla Open API Reference for Tekla Structures 2025
Surfacing.SurfacingAttributes Constructor (String)
 Creates a new surfacing attributes instance that loads the specified attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SurfacingAttributes(
	string AttributeFile
)
Public Sub New (
	AttributeFile As String
)
Parameters
AttributeFile
Type: System.String
The name of the attribute file.
See Also
Reference
Surfacing.SurfacingAttributes Class
Surfacing.SurfacingAttributes Overload
Tekla.Structures.Drawing Namespace